print('Привет')
print('Напишите несколько чисел. Ваше первое число?')
a = int(input())
print('Напишите второе число')
b = int(input())
print('Напишите третье число')
c = int(input())
if (a*b = c):
    print('Условие о равенстве произведении первых чисел третьему верно')
else:
    print('Условие о равенстве произведения первых чисел третьему не верно')

if (b*c) = a):
    print('Условие о равенстве частного первых чисел третьему верно')
else:
    print('Условие о равенстве частного первых чисел третьему не верно')
input()
